#### LightShapeStyle Enumeration

---

|  |
| --- |
| See Also |

Tags for specific light shape styles

**Namespace:**   Autodesk.Revit.DB.Lighting
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public enum LightShapeStyle ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration LightShapeStyle ``` |

| Visual C++ |
| --- |
| ``` public enum class LightShapeStyle ``` |

# Members

| Member name | Description |
| --- | --- |
| Point | Point light shape. |
| Line | Line light shape. |
| Rectangle | Rectangular light shape. |
| Circle | Circular light shape. |

# See Also

Autodesk.Revit.DB.Lighting Namespace